#--------------------------------------------
# 1. hello world 출력할 것 
#--------------------------------------------
print('hello world')
#--------------------------------------------
# 2. 숫자의 사칙연산 
# 
# 아래의 모든 assert문을 통과하도록 ==의 오른쪽 값을 바꾸세요.
#--------------------------------------------
assert 1 + 3 == 4
assert 3 // 3 == 1
assert 5 % 2 == 1
assert 6 / 2 == 3.0
#--------------------------------------------
# 3. 주어진 문자열을 이용해서 다른 문자열 만들어보기 
# 
# 아래에 주어진 문자열 a, b를 이용해서 문자열 c, d를 만들어보세요. 
#--------------------------------------------
a = 'hello'
b = 'world'

c = 'hello world'
d = 'hello world hello world'

c = f'{a} {b}'
d = f'{a} {b} '*2
#--------------------------------------------
# 4. n이 짝수면 is even, 아니면 is odd 출력 
#--------------------------------------------
n = 5 
# write your code here 
print('is even') if n%2==0 else print('is odd')
#--------------------------------------------
# 5. len, type, isinstance 함수들 써보기 
#--------------------------------------------
class A:
  a=[ 1,'2',[3],(4),{5}, list(range( [10] )) ]
isinstance(A.a, A)
isinstance(A.a, list)
print([ ( type(A.a[i]) ) for i in range(len(A.a)) ])
